---
kind: method
id: M:Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer.ShowSettings(Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData)
source: html/f3348aed-0d69-1901-fbbe-a9cacb3f4d22.htm
---
# Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer.ShowSettings Method

Shows the settings UI.

## Syntax (C#)
```csharp
bool ShowSettings(
	DuctFittingAndAccessoryPressureDropUIData data
)
```

## Parameters
- **data** (`Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData`) - The input data of the calculation.

## Returns
True if the user makes any changes in the UI, false otherwise.